Repository: EPITECH-IT-2028/Area
Catalog: apps/mobile/AREA/AREA/Sources/Utilities/Localizable.xcstrings
Source language: en
Languages: fr

# Actions.NoActions.Title
source: No action found.
fr: Aucune action trouvée.

# Actions.NoResult.Title
source: No result found.
fr: Aucun résultat trouvé.

# AreaCreation.ActionLocked.Title
source: Action locked:
fr: Action verrouillée:

# AreaCreation.AreaCreated.Title
source: Your AREA has been successfully created.
fr: Votre AREA a bien été créée !

# AreaCreation.ChooseReaction.Title
source: Choose the reaction service
fr: Choisir le service de réaction

# AreaCreation.createArea.title
source: Create your AREA.
fr: Créez votre AREA.

# AreaCreation.ErrorAreaCreation.Title
source: Your AREA could not be created. Please try again.
fr: Votre AREA n'a pas pu être créée. Veuillez réessayer.

# AreaCreation.ErrorEmptyRequiredField.Title
source: Please fill in all required fields.
fr: Veuillez remplir tous les champs requis.

# AreaCreation.NextChooseReaction.Title
source: Next: Choose your reaction.
fr: Suivant: Choisir la réaction

# AreaCreation.Reactions.Title
source: Reactions
fr: Réactions

# ContentView.WelcomeMessage
source: Hello World!
fr: Bonjour Monde!

# Error.Happened.Title
source: An error just happened, try again.
fr: Une erreur vient de survenir, réessayez.

# Error.InvalidHost
source: Invalid host
fr: Host invalide

# Error.InvalidPort
source: Invalid port
fr: Port invalide

# Error.InvalidScheme
source: Invalid scheme
fr: Schéma invalide

# Error.RegisterViewOnAppear
source: Keychain error in RegisterView.onAppear:
fr: Erreur de trousseau dans RegisterView.onAppear :

# Error.Title
source: Error
fr: Erreur

# ErrorKeychainSet
source: An error occurred when setting the keychain value.
fr: Une erreur est survenue pendant l’attribution de valeur dans le trousseau.

# Home.Card.Active
source: Active
fr: Activé

# Home.Card.Inactive
source: Inactive
fr: Désactivé

# Home.Card.Reaction
source: Reaction
fr: Réaction

# Home.EditModal.Cancel
source: Cancel
fr: Annuler

# Home.EditModal.Delete
source: Delete
fr: Supprimer

# Home.EditModal.DeleteAREA
source: Delete AREA
fr: Supprimer l’AREA

# Home.EditModal.EditAREA
source: Edit AREA
fr: Modifier l’AREA

# Home.EditModal.GeneralInformation
source: General Information
fr: Information générale

# Home.EditModal.Name
source: Name
fr: Nom

# Home.EditModal.Save
source: Save
fr: Sauvegarder

# Home.EditModal.Status
source: Status
fr: Statut

# Home.EditModal.SureToDelete
source: Are you sure you want to delete the AREA ? This action can’t be undone.
fr: Êtes-vous sûr de vouloir supprimer l’AREA ? Cette action est irréversible.

# Home.Title
source: Home
fr: Accueil

# Login.ForgotPassword.Title
source: Forgot password ?
fr: Mot de passe oublié

# Login.LoginButton.Title
source: Login
fr: Connecter

# Login.LoginWithGitHub
source: Log in with GitHub
fr: Se connecter avec GitHub

# Login.LoginWithGoogle
source: Log in with Google
fr: Se connecter avec Google

# Login.NoAccountRegister.Title
source: You don’t have an account ?
fr: Vous n’avez toujours pas de compte ?

# Login.PasswordField.Title
source: Password
fr: Mot de passe

# Login.ResetButton.Title
source: Reset Password
fr: Réinitialiser le mot de passe

# Login.ResetPassword.Title
source: New Password
fr: Nouveau mot de passe

# OAuth2.ErrorPresentationAnchor
source: No UIWindowScene available for presentation anchor.
fr: Pas d’UIWindowScene disponible pour l’ancre de présentation.

# ReactionsNoReactionsTitle
source: No reaction found.
fr: Aucune réaction trouvée.

# Register.AlreadyHaveAccount.Title
source: You already have an account ?
fr: Vous avez déjà un compte ?

# Register.BadUrlResponse
source: Bad URL Response:
fr: Mauvaise réponse URL:

# Register.ConfirmedPasswordField.Title
source: Confirmed password
fr: Confirmer le mot de passe

# Register.DecodingIssue
source: Decoding issue:
fr: Erreur de décodage:

# Register.EmailNotValid
source: Email is not valid.
fr: L’email est invalide.

# Register.GoogleInvalidResponseFromServer
source: Invalid response from server.
fr: Réponse invalide du serveur.

# Register.GoogleMissingConfigClientId
source: Google client ID is missing in configuration.
fr: ID client Google manquant dans la configuration.

# Register.GoogleMissingViewForGoogleConnexion
source: Missing root view for google connection.
fr: Impossible de trouver la vue racine pour afficher la connexion Google.

# Register.GoogleUnableToRetrieveIdToken
source: Unable to retrieve the Google ID token.
fr: Impossible de récupérer l'ID token Google.

# Register.NameField.Title
source: Name
fr: Nom

# Register.PasswordDoNotMatch
source: Passwords do not match.
fr: Les mots de passe ne correspondent pas.

# Register.PasswordField.Title
source: Password
fr: Mot de passe

# Register.PasswordNoCaps
source: Your password must contain at least 1 capital letter.
fr: Le mot de passe doit contenir au moins une lettre majuscule.

# Register.PasswordNoLowers
source: Your password must contain at least 1 lowercase letter.
fr: Le mot de passe doit contenir au moins une lettre minuscule.

# Register.PasswordNoNumber
source: Your password must contain at least 1 number.
fr: Le mot de passe doit contenir au moins un chiffre.

# Register.PasswordNoSpecialChar
source: Your password must contain at least 1 special character.
fr: Le mot de passe doit contenir au moins un caractère spécial.

# Register.PasswordTooShort
source: Your password must be at least 8 characters long.
fr: Le mot de passe doit contenir au moins 8 caractères.

# Register.RegisterButton.Title
source: Register
fr: S’inscrire

# Register.UnknownError
source: Unknown error
fr: Erreur inconnue

# Services.Connection.Alert.Title
source: Connection
fr: Connexion

# Settings.ErrorLogout
source: An error occurred when trying to log you out.
fr: Une erreur s’est produite pendant la tentative de déconnexion.

# Settings.Logout
source: Log out
fr: Se déconnecter

# Settings.Logout.Cancel
source: Cancel
fr: Annuler

# Settings.Logout.Confirm
source: Confirm
fr: Confirmer

# Settings.Title
source: Settings
fr: Paramètres

# Settings.UpdateServerPath.Title
source: Update server path
fr: Modifier le chemin vers le serveur

# Settings.WantToLogout
source: Are you sure you want to log out ?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# Success.Title
source: Success
fr: Succès

# TryAgain.Title
source: Try again
fr: Réessayer

# UpdateServerPath.Cancel.Title
source: Cancel
fr: Annuler

# UpdateServerPath.CurrentPath.Title
source: Your new path will be :
fr: Votre nouveau chemin va être :

# UpdateServerPath.ExplainFormat.Title
source: You need to enter the correct path thanks to the following format : scheme://host:port
fr: Vous devez entrer le bon chemin grâce au format suivant : scheme://host:port

# UpdateServerPath.Save.Title
source: Save
fr: Sauvegarder

# UpdateServerPath.SaveAlertMessage.Title
source: Are you sure you want to save the new server path ?
fr: Êtes-vous sûr de vouloir sauvegarder le nouveau chemin vers le serveur ?

# UpdateServerPath.SaveNewPath.Title
source: Save new server path
fr: Sauvegarder le nouveau chemin vers le serveur

# UpdateServerPath.ServerHost.Title
source: Enter server host
fr: Entrez l’hôte du serveur

# UpdateServerPath.ServerPort.Title
source: Enter server port (between 1 and 65535)
fr: Entrer le port du serveur (entre 1 et 65535)

# UpdateServerPath.ServerScheme.Title
source: Enter server scheme (either http or https)
fr: Entrez le schéma du serveur (http ou https)
